{
  "common": {
    "english": "English",
    "turkish": "Turkish",
    "german": "German",
    "welcome": "Welcome to my React Native project",
    "langChangeButtonTextTr": "Change the application language to Turkish",
    "langChangeButtonTextEn": "Change the application language to English",
    "langChangeButtonTextDe": "Change the application language to German",
    "themeSettings": "Theme Settings",
    "languageSettings": "Language Settings",
    "settings": "Settings",
    "selectATheme": "Select a theme",
    "selectALanguage": "Select a language",
    "enterText": "Enter text..."
  },
  "components": {
    "aboutTheApplication": "About the application...",
    "applicationDescription": "This application is a tool that helps to create and develop custom 'react-native android' applications more quickly. It includes many features such as basic components, custom components, Redux Toolkit integration, support for multiple themes, and support for multiple languages. Thanks to its flexible structure, it can be easily customized according to needs.\n\nThis version is the initial release of the application. In the next version, enhancements such as the API layer with Redux Toolkit, advanced components, 'login page', 'registration page', 'user profile page', 'forgot password page', and others will be added. Additionally, existing components will also be updated as needed.",
    "version": "Version",
    "goToNpm": "Go to NPM Page",
    "buttonPlayground": "Button - Playground",
    "typographyPlayground": "Typography - Playground",
    "iconPlayground": "Icon - Playground",
    "checkboxPlayground": "Checkbox - Playground",
    "textInputPlayground": "TextInput - Playground",
    "radioButtonPlayground": "Radio-Button - Playground",
    "dropdownPlayground": "Dropdown - Playground",
    "goToDetail": "Go to Detail",
    "componentsViewButtonDesc": "If you wish, you can examine and customize the buttons offered by the application.",
    "componentsViewTypographyDesc": "If you wish, you can review and customize the typographies offered by the app.",
    "componentsViewIconDesc": "If you wish, you can examine the icon features offered by the app.",
    "componentsViewCheckboxDesc": "If you wish, you can examine the checkbox features offered by the app.",
    "componentsViewTextInputDesc": "If you wish, you can examine the 'text input' features offered by the app.",
    "componentsViewRadioButtonDesc": "If you wish, you can examine the 'radio button' features offered by the app.",
    "componentsViewDropdownDesc": "If you wish, you can examine the 'dropdown' features offered by the app.",
    "observeComponent": "Observe Component",
    "customizeComponent": "Customize Component",
    "readyComponents": "Ready Components",
    "selectSize": "Select size",
    "enterSize": "Enter size",
    "selectColor": "Select color",
    "selectVariant": "Select variant",
    "selectRadius": "Select radius",
    "addIcon": "Add icon",
    "selectLocationForIcon": "Select location for icon",
    "selectKeyboardType": "Select keyboard type",
    "selectUsageType": "Select usage type",
    "disableComponent": "Disable component",
    "enterPlaceholder": "Enter placeholder",
    "openMenuAsADialogBox": "Open menu as a dialog box",
    "activateFilteringInTheMenu": "Activate filtering in the menu",
    "enterPlaceholderIntoFiltering": "Enter placeholder into filtering",
    "zzz": "zzz"
  },
  "npmDependencies": {
    "emotionNativeDescription": "A library providing CSS-in-JS solution. Used for styling in React Native projects. Allows defining styles for components as JavaScript objects.",
    "emotionReactDescription": "Fundamental library for React applications. Provides CSS-in-JS solution for styling React components. Used in conjunction with @emotion/native.",
    "reactNativeAsyncStorageAsyncStorageDescription": "A library used for asynchronous storage operations in React Native applications. Typically used for storing data like user preferences, session information, local data, etc.",
    "reactNavigationBottomTabsDescription": "Part of React Navigation library providing bottom tab navigation. Often used to create bottom tab menus.",
    "reactNavigationNativeDescription": "Core part of React Navigation library. Provides navigation functionality in React Native applications. Supports stack, tab, drawer, and other navigation structures.",
    "reactNavigationNativeStackDescription": "Part of React Navigation library providing stack-based navigation. Manages navigation based on stacks.",
    "reduxjsToolkitDescription": "Official package for Redux called Redux Toolkit. Used for developing Redux-based applications. Facilitates Redux usage and enables quick creation of typical Redux structures.",
    "i18NextDescription": "A JavaScript library used for developing multilingual applications. Used for localization of content and presenting it in the user's preferred language.",
    "reactDescription": "A JavaScript library developed by Facebook, used for building UIs. React has a component-based structure and enhances performance using virtual DOM.",
    "reactI18nextDescription": "Provides i18next integration for React applications. Used for developing multilingual applications and easing localization processes.",
    "reactNativeDescription": "A framework developed by Facebook, used for building mobile applications. Enables building native applications for Android and iOS using JavaScript and React.",
    "reactNativeElementDropdownDescription": "A library used for creating dropdown menus in React Native applications.",
    "reactNativeSafeAreaContextDescription": "A library providing access to safe area information on devices like iPhone X and later models. These devices have extra space at the top and bottom of the screen, and this library allows adjusting UIs considering these areas.",
    "reactNativeScreens": "A library containing optimized screen components for React Navigation. Used to enhance performance.",
    "reactNativeSvgDescription": "A library used for rendering Scalable Vector Graphics (SVG) images in React Native applications.",
    "reactNativeSvgTransformerDescription": "A transformer allowing the use of SVG files in React Native. Converts SVG files into components for usage.",
    "reactNativeVectorIconsDescription": "A library used for using vector icons in React Native applications. Contains icon sets like IconData or FontAwesome.",
    "reactReduxDescription": "A library facilitating the integration of Redux with React applications. Simplifies state management in Redux-based applications and connects Redux store to components."
  }
}
